// [PGS] 두 수의 차
// 난이도 :  level 0
// 소요시간 : 10초이내
// 점수 : 1

/*
문제 설명
정수 num1과 num2가 주어질 때, num1에서 num2를 뺀 값을 return하도록 soltuion 함수를 완성해주세요.

제한사항
-50000 ≤ num1 ≤ 50000
-50000 ≤ num2 ≤ 50000
입출력 예
num1	num2	result
2	3	-1
100	2	98
입출력 예 설명
입출력 예 #1

num1이 2이고 num2가 3이므로 2 - 3 = -1을 return합니다.
입출력 예 #2

num1이 100이고 num2가 2이므로 100 - 2 = 98을 return합니다.

*/

/*
< 의사코드 > 


*/

function solution(num1, num2) {
  return num1 - num2
}
/*
테스트 1 〉	통과 (0.04ms, 33.3MB)
테스트 2 〉	통과 (0.03ms, 33.6MB)
테스트 3 〉	통과 (0.03ms, 33.5MB)
테스트 4 〉	통과 (0.04ms, 33.5MB)
테스트 5 〉	통과 (0.03ms, 33.5MB)
테스트 6 〉	통과 (0.04ms, 33.6MB)
테스트 7 〉	통과 (0.04ms, 33.6MB)
테스트 8 〉	통과 (0.02ms, 33.6MB)
테스트 9 〉	통과 (0.02ms, 33.5MB)
테스트 10 〉	통과 (0.03ms, 33.6MB)
테스트 11 〉	통과 (0.04ms, 33.6MB)
테스트 12 〉	통과 (0.06ms, 33.6MB)
테스트 13 〉	통과 (0.02ms, 33.5MB)
테스트 14 〉	통과 (0.02ms, 33.5MB)
테스트 15 〉	통과 (0.04ms, 33.6MB)
테스트 16 〉	통과 (0.04ms, 33.6MB)

*/

